mafikes/mafikes-esP8266-watch/src/Components/NTP.cpp
#include <NTP.h>
#include <NTPClient.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <RTC.h>
#include <Config.h>

const long utcOffsetInSeconds = 0; // + 2 hours
WiFiUDP ntpUDP;
NTPClient timeClient(ntpUDP, "pool.ntp.org", utcOffsetInSeconds);

void NTP::updateTime() {
    Serial.println("Time updated via NTP.");

    timeClient.setTimeOffset(3600 * Config::getInstance().data.time_offset);
    timeClient.update();

    time_t rawtime = timeClient.getEpochTime();
    struct tm * ti;
    ti = localtime(&rawtime);

    // Year
    uint16_t year = ti->tm_year + 1900;
    String yearStr = String(year);

    // Month
    uint8_t month = ti->tm_mon + 1;
    String monthStr = month < 10 ? "0" + String(month) : String(month);

    // Day
    uint8_t day = ti->tm_mday;
    String dayStr = day < 10 ? "0" + String(day) : String(day);

    Serial.print("NTP Date: ");
    Serial.print(day);
    Serial.print(".");
    Serial.print(month);
    Serial.print(".");
    Serial.println(year);
    
    RTC::getInstance().setNewTime(DateTime(year, month, day, timeClient.getHours(), timeClient.getMinutes(), timeClient.getSeconds()));
}

void NTP::loop() {
    // Update Time by set time    
    unsigned long currentMillis = millis();
    if ((unsigned long)(currentMillis - prevTime) >= ((1000 * 60) * 60) || firstStart) { 
        updateTime();
        prevTime = currentMillis;   
        firstStart = false;     
    }
}

void NTP::setup() {
    while ( WiFi.status() != WL_CONNECTED ) {
        Serial.println("Wifi not connect, NTP cant be load.");
    }

    timeClient.begin();
}
